[
  {
    "name": "Spaceman Jasper",
    "dialogue": [": \n Do you have any lightning glass? \n I have rice to trade.", ": \n There's nothing like a \n spacewalk in the morning."]
  },
  {
    "name": "Spaceman Sam",
    "dialogue": [": \n Do you have any interesting fossils? \n I make the best spaghetti sauce, \n but I don’t give it to strangers \n for free.", ": \n If anyone asks, I'm not out here."]
  },
  {
    "name": "Spaceman Nyckolle",
    "dialogue": [": \n Salsa is my jam! I’ll trade you some \n for something sparkly from the \n snow planet!", ": \n Have you looked at all the plants?"]
  },
  {
    "name": "Spaceman Kun",
    "dialogue": [": \n Have you been to the Volcano planet? \n I hear they have beautiful \n rocks there.", ": \n Did you end up cooking \n something nice?"]
  },
  {
    "name": "Gardener",
    "dialogue": [": \n Check this out! Plants are amazing, aren’t they? \n What a lovely day for gardening!"]
  },
  {
    "name": "Fitness Fanatic",
    "dialogue": [": \n I always sneak into the kitchen for extra gains. Shh, don’t tell anyone!\n Whoa, that butter gave you killer biceps!!"]
  },
  {
    "name": "Cadet",
    "dialogue": [": \n Want these? I got an extra bag at the commissary.\n You can never have too many Tortillas."]
  },
  {
    "name": "Head Chef",
    "dialogue": [": \n Hello, Sous Chef!"]
  },
  {
    "name": "Shadowy Figure",
    "dialogue": [": \n Get me some Snacks and I'll give you a reward.\n Mmm... stolen Snacks always taste the best."]
  },
  {
    "name": "Information Center Liaison",
    "dialogue": [": \n Do you need a GPS? They can be used to navigate to the Volcano Planet, \n the Rainforest Planet, the Snow Planet, the Swamp Planet and the Desert Planet.\n Traveling to distant planets can be dangerous. Be careful!"]
  },
  {
    "name": "Lab Technician",
    "dialogue": [": \n Did you know the ship’s tofu is lab-grown. \n Tofu is delicious, no matter where it came from."]
  },
  {
    "name": "Pod Technician",
    "dialogue": [": \n You sure you know how to fly this thing? Make sure you use gps.\n Safe travels!"]
  },
  {
    "name": "Random Alien",
    "dialog": [
      "%s: Hello, Spacewalker, have you ever tried the local hot springs? They're great for relaxing after a long day of running away from lava.",
      "%s: Hello, Spacewalker, I'm not saying I'm an expert on volcanoes, but I do have a PhD in lava dodging.",
      "%s: Hello, Spacewalker, if you want to impress the locals, try eating a volcano pepper. Just don't come crying to me when your insides start to melt.",
      "%s: Hello, Spacewalker, I'm convinced that the only reason the volcanoes on this planet erupt so often is because they're angry at us for being so delicious.",
      "%s: Hello, Spacewalker, I once tried to ride a lava flow like a surfboard. It did not end well.",
      "%s: Hello, Spacewalker, do you know what they call a group of aliens who live near a volcano? Toast.",
      "%s: Hello, Spacewalker, I've always said that the key to survival on this planet is to have a good pair of running shoes and a healthy fear of molten rock.",
      "%s: Hello, Spacewalker, some aliens come to this planet for the thrill of dodging lava. I'm just here for the marshmallows.",
      "%s: Hello, Spacewalker, I heard a rumor that the volcanoes on this planet are actually giant alien barbecue grills. Just don't tell the humans.",
      "%s: Hello, Spacewalker, if you ever need a place to stay, I've got a spare lava-proof igloo. It's not much, but it's home."
    ]
  },
  {
    "name": "Spacewalker Felix",
    "dialog": [
      "%s: Hello, Spacewalker, did you know that the mud here is so thick, even the mosquitoes have trouble flying through it?",
      "%s: Hello, Spacewalker, I'm not afraid of the alligators here. It's the mosquitoes I'm worried about. They're the real predators.",
      "%s: Hello, Spacewalker, I once saw a plant here that was so big, it tried to eat me. Luckily, I was too tough to digest.",
      "%s: Hello, Spacewalker, if you need me, I'll be in my swamp hut, cooking up some 'gator gumbo. Want to try some?",
      "%s: Hello, Spacewalker, I have a pet mosquito named Buzz. He's a real pain in the neck, but he's loyal.",
      "%s: Hello, Spacewalker, I once tried to make a raft out of vines and leaves. It didn't work, but I ended up with a really cool hat.",
      "%s: Hello, Spacewalker, the mosquitoes here are so big, they have landing strips for planes. No joke.",
      "%s: Hello, Spacewalker, I once saw a frog here that was so big, it ate an alligator. Or maybe it was the other way around. I forget.",
      "%s: Hello, Spacewalker, if you ever get lost in the swamp, just look for the giant neon sign that says 'Welcome to North Swamp Planet.' We spare no expense.",
      "%s: Hello, Spacewalker, I once wrestled an alligator here. It was a draw, but I think he let me win."
    ]
  },
  {
    "name": "Desert Alien",
    "dialog": [
      "%s: Hello, Spacewalker, I don't always drink water, but when I do, I prefer it with a side of sand.",
      "%s: Hello, Spacewalker, I tried to make a sandcastle once, but it just turned into a pile of sand. Oops!",
      "%s: Hello, Spacewalker, I love a good sandstorm. It's like a giant, sandy hug.",
      "%s: Hello, Spacewalker, Do you have any idea how hard it is to find a good cactus to hug around here?",
      "%s: Hello, Spacewalker, I once met a space cowboy who tried to lasso a sand dune. He wasn't very good.",
      "%s: Hello, Spacewalker, Why did the desert alien cross the road? To get to the sand dune on the other side!",
      "%s: Hello, Spacewalker, My favorite pastime is playing hide-and-seek with the tumbleweeds.",
      "%s: Hello, Spacewalker, Have you tried our local delicacy, the sand sandwich? It's just sand between two slices of sand.",
      "%s: Hello, Spacewalker, I heard that Earthlings have something called 'ice cream.' Sounds terrifying.",
      "%s: Hello, Spacewalker, I used to be a sand castle architect, but I got sandbagged by the competition."
    ]
  },
  {
    "name": "Lava Monster",
    "dialogue": ["%s: Hello, Spacewalker"],
    "riddles": {
      "I am hot and molten, and reside underneath the Earth's crust. \nWhat am I? " : "Magma",
      "I am a type of lava flow. I appear smooth, and have a low viscosity. \nWhat is my name?": "Pahoehoe",
      "I am a large crater caused by a volcanic explosion that collapses into a depression. \nWhat am I?": "Caldera"
    }
  },
  {
    "name": "Vine Monster",
    "dialogue": ["%s: Hello, Spacewalker"],
    "riddles": {
      "I am a spotted cat and I do not roar. \nI live on the forest floor and in the understory. \nWhat am I?": "Jaguar",
      "I am a furry creature with eight legs. \nI hide during the day and come out at night to hunt small birds and reptiles. \nWhat am I?": "Tarantula",
      "I am a mammal. I can climb trees but I usually live on the forest floor. \nI am seven feet long from my nose to my tail. I eat termites and ants. \nWhat am I?": "Anteater"
    }
  },
  {
    "name": "Ice Monster",
    "dialogue": ["%s: Hello, Spacewalker"],
    "riddles": {}
  },
  {
    "name": "Swamp Monster",
    "dialogue": ["%s: Hello, Spacewalker"],
    "riddles": {}
  },
  {
    "name": "Sand Monster",
    "dialogue": ["%s: Hello, Spacewalker"],
    "riddles": {
      "What is the name for a place where stars are born?": "Nebula",
      "What is a name for a natural satellite?" : "Moon",
      "I can have 1 or 2 humps, a very long neck, and am known for taking long treks across the desert. \nWhat am I?": "Camel"
    }
  }




]


